tap "heroku/brew"
tap "homebrew/bundle"

# Mac Apps
cask "kitty"
cask "localsend"
cask "ngrok"
cask "visual-studio-code"

# Terminal utilities
brew "ack"
#brew "ast-grep"
brew "eza"
brew "fastfetch"
#brew "fd"
brew "ffmpeg"
#brew "fzf"
brew "powerlevel10k"
brew "ripgrep"
#brew "starship"
brew "stow"
#brew "wget"
#brew "zoxide"

# Development tools
brew "git"
brew "gnupg"
brew "heroku"
brew "lazydocker"
brew "lazygit"
brew "neovim"

# Programming Languages
brew "go"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "python@3.13"
brew "rust"

# Development libraries
#brew "graphviz"
brew "libpq", link: true
brew "mysql-client"
brew "utf8proc", args: ["HEAD"]
brew "vips"

# VSCode extensions
vscode "clemenspeters.format-json"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "github.copilot-chat"
vscode "github.copilot"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "shopify.ruby-lsp"
vscode "vscodevim.vim"