tap "heroku/brew"
tap "homebrew/bundle"

# Mac Apps
# cask "cursor"
cask "ghostty"
# cask "localsend"
cask "ngrok"
# cask "visual-studio-code"
cask "vnc-viewer"

# Terminal utilities
brew "ack"
brew "ast-grep"
brew "bat"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "nushell"
brew "oh-my-posh"
# brew "powerlevel10k"
brew "ripgrep"
# brew "starship"
brew "stow"
brew "tree"
#brew "wget"
brew "zoxide"

# Development tools
# brew "deno"
brew "git"
brew "gnupg"
brew "heroku"
brew "lazydocker"
brew "lazygit"
brew "neovim"
# brew "node"
# brew "pnpm"

# Programming Languages
brew "golang"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "python@3.13"
brew "rust"

# Development libraries
#brew "graphviz"
brew "libpq", link: true
# brew "mysql-client"
brew "utf8proc", args: ["HEAD"]
brew "vips"

# VSCode extensions
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "clemenspeters.format-json"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "denoland.vscode-deno"
vscode "dsznajder.es7-react-js-snippets"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "shopify.ruby-lsp"
vscode "vscodevim.vim"

